БСП_ВА/src/InformationRegisters/ОбъектыКОтправке/ОбъектыКОтправке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОбъектыКОтправке</name>
  <resources>
    <name>ИдентификаторФайла</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <dimensions>
    <name>УчетнаяСистема</name>
    <type>
      <types>DefinedType.УчетныеСистемыИнтеграцииОбластейДанных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Обработчик</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БСП_ВА/src/InformationRegisters/ОбъектыКОтправке/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы
    
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    ИдентификаторФайла = Запись.ИдентификаторФайла;
    
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьОповещение(Команда)
    ОтправитьОповещениеНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИдентификаторФайлаОткрытие(Элемент, СтандартнаяОбработка)
    
    СтандартнаяОбработка = Ложь;
    Если ЗначениеЗаполнено(Запись.ИдентификаторФайла) Тогда
        ОписаниеПередаваемогоФайла = ОписаниеПередаваемогоФайла(Запись.ИдентификаторФайла);
        Оповещение = Новый ОписаниеОповещения("НачатьПолучениеФайловЗавершение", ЭтотОбъект);
        ПолучаемыеФайлы = Новый Массив;
        ПолучаемыеФайлы.Добавить(ОписаниеПередаваемогоФайла);
    	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
    	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
        ДиалогВыбораФайла.Фильтр = НСтр("ru = 'Все файлы (*.*)|*.*'"); 
        НачатьПолучениеФайлов(Оповещение, ПолучаемыеФайлы, ДиалогВыбораФайла);
    КонецЕсли; 
    
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции
    
&НаСервере
Процедура ОтправитьОповещениеНаСервере()
    
    ИнтеграцияОбъектовОбластейДанных.ОповеститьОбИзмененииОбъекта(
        Запись.УчетнаяСистема, Запись.ИдентификаторОбъекта, Истина);
    
КонецПроцедуры

&НаКлиенте 
Процедура НачатьПолучениеФайловЗавершение(ПолученныеФайлы, ДополнительныеПараметры) Экспорт
    
    Если ЗначениеЗаполнено(ПолученныеФайлы) Тогда
    	ОписаниеФайла = ПолученныеФайлы[0]; // ОписаниеПередаваемогоФайла
    	ИмяФайла = ОписаниеФайла.Имя;
        Оповещение = Новый ОписаниеОповещения("ПриНажатииОповещенияПолученияФайла", ЭтотОбъект, ИмяФайла);
        ПоказатьОповещениеПользователя(НСтр("ru = 'Файл сохранен'"), Оповещение, ИмяФайла, БиблиотекаКартинок.Информация32);     
    КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ОписаниеПередаваемогоФайла(ИдентификаторФайла)
    
    Возврат ФайлыОбластейДанных.ОписаниеПередаваемогоФайла(ИдентификаторФайла, УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Функция ПриНажатииОповещенияПолученияФайла(ПолноеИмяФайла) Экспорт
    
	ФайловаяСистемаКлиент.ОткрытьФайл(ПолноеИмяФайла);
	
КонецФункции

#КонецОбласти
